//******************************************************************************
//Canvasの各メソッドを試すプログラム
//******************************************************************************


//==============================================================================
//クラスライブラリのインポート
//==============================================================================
import java.awt.*;
import javax.swing.*;


//==============================================================================
//メインクラス
//==============================================================================
public class Canvas_test
{

 //==============================================================================
 //メインメソッド
 //==============================================================================
 public static void main(String[] args)
 {

  //============================================================================
  //フレームの作成
  JFrame frame = new JFrame();
 
  //タイトルを設定
  frame.setTitle("Canvas_test");

  //フレーム（ウィンドウ）のサイズを設定
  frame.setBounds(100, 100, 600, 400);

  //×ボタンを押したときの処理を記述
  frame.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);

  //ウィンドウサイズは固定
  frame.setResizable(true);

  //レイアウトは手動
  frame.setLayout(null);


  //============================================================================  
  //コンテントペインの作成
  JPanel cp = new JPanel();

  //レイアウトは手動
  cp.setLayout(null);

  //フレームにコンテントペインを登録
  frame.add(cp);

  //コンテントペインの貼り付け位置・大きさを設定
  cp.setBounds (0, 0, 100, 100);
 

  //============================================================================   
  //キャンバスの作成
  TestCanvas canvas = new TestCanvas();

  //キャンバスをコンテント・ペインに登録
  cp.add(canvas);

  //キャンパスの位置はコンテントペインに合わせる。
  //キャンバスのサイズはコンテントペインと同じにする。
  canvas.setBounds (10, 10, 500, 300);

  


  //============================================================================   
  //最後に、フレームの可視化
  frame.setVisible(true);
 }

}


