20140805

フィギュアスケートジャッジングシステムを作成する。
今考えているのは以下の要領

・採点のプログラムを作成
・採点集計プログラムの作成
・画面の作成
・ログイン画面の作成
・ベータ版としてリリース

基本的には簡単な実装で作ってみたい。
（最初はOBO方式で良いと思う）


採点プログラム
-----------------

*方針*
  基本的にはメインのクラスを実行すると登録される。
  メインのクラスを実行する時に属性を決めておく。
  その属性のクラスを作成する。
    理由：それほど種類が多くなるとは思えない。

  値は返す？採点方式は渡す前に持っている。
  結果のレコードを返せば良い。
  (DBも極力共通化するようにした方がいいな。）

*課題点*
  クラス分けをどうすれば良いのか？
  〇〇採点で全てを1セットにする？
  採点でクラスを作ってしまう？
  --->でも基本的に大切にしたいのは、全体の流れ。
      なので、今は流れの中で分けるように使用しようか。

20140810

大まかに振り分けが出来るようにした。
あとはここのモジュールを作成するようにするだけ。
DB接続のライブラリとかは現行のものよりもパワーアップさせる。

DB定義の追加
・スケートの粒度としては以下なので、各指標を作るようにする。
  年度>大会名>グループ>滑走順
  少なくとも大会名までは必要と思われる。
  しばらくは、大会をたくさん作りながら、点数をつけ合うような遊びにすればよいのかなって思っている。

